# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [8]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [9]:
cur.execute('''select city from offices limit 10''').fetchall()

[('San Francisco',),
 ('Boston',),
 ('NYC',),
 ('Paris',),
 ('Tokyo',),
 ('Sydney',),
 ('London',)]

In [11]:
#Your code here
cur.execute('''select firstName,lastName, city 
                from employees 
                join 
                    offices 
                on 
                    employees.officeCode = offices.officeCode
                ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df[df.city == 'Boston']

  firstName   lastName    city
8     Julie   Firrelli  Boston
9     Steve  Patterson  Boston

## Do any offices have no employees?

In [16]:
#Your code here
cur.execute('''select firstName, lastName, city
                from employees
                left join
                    offices
                using(officeCode)''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
print(len(df[df.city.isnull()]))

23
0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [33]:
# Your code here
# How many customers have purchased more than 3 products?
cur.execute('''select customerName, orderNumber
                from orders
                left join
                    customers
                using(customerNumber)''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.customerName.value_counts()[df.customerName.value_counts() >= 3].count()

67

In [48]:
# Your code here
# Which item has been purchased the most?
cur.execute('''select productName, quantityOrdered
                from products
                left join
                    orderdetails
                    using(productCode)
                left join
                    orders
                    using(orderNumber)
                    ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.info() # Must convert quantity ordered to int
df.quantityOrdered = pd.to_numeric(df.quantityOrdered, errors='coerce').fillna(0)
df.groupby('productName').sum().sort_values(by = 'quantityOrdered', ascending = False).head(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2997 entries, 0 to 2996
Data columns (total 2 columns):
productName        2997 non-null object
quantityOrdered    2996 non-null object
dtypes: object(2)
memory usage: 46.9+ KB

                             quantityOrdered
productName
1992 Ferrari 360 Spider red           1808.0

In [51]:
# Your code here
# Which item is responsible for the most revenue?
cur.execute('''select productName, quantityOrdered, buyPrice
                from products
                left join
                    orderdetails
                    using(productCode)
                left join
                    orders
                    using(orderNumber);
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.quantityOrdered = pd.to_numeric(df.quantityOrdered, errors='coerce').fillna(0)
df.buyPrice = pd.to_numeric(df.buyPrice, errors = 'coerce').fillna(0)
df['revenue'] = df.buyPrice * df.quantityOrdered
df.groupby('productName').sum().sort_values(by = 'revenue', ascending = False).head(1)

                             quantityOrdered  buyPrice   revenue
productName
1992 Ferrari 360 Spider red           1808.0    4128.7  140843.2

## Level Up: Display the names of each product each employee has sold.

In [102]:
# Your code here
cur.execute('''select firstName, lastName,productName
                from employees
                inner join
                    customers
                    on customers.salesRepEmployeeNumber = employees.employeeNumber
                inner join
                    orders
                    using(customerNumber)
                inner join
                    orderdetails
                    using(orderNumber)
                inner join
                    products
                    using(productCode);
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.groupby(['lastName', 'firstName']).count()
# Not showing the product names because the list is way too long. Showing the counts of unique
# items sold instead.

                     productName
lastName  firstName
Bondur    Loui               177
Bott      Larry              236
Castillo  Pamela             272
Firrelli  Julie              124
Fixter    Andy               185
Gerard    Martin             114
Hernandez Gerard             396
Jennings  Leslie             331
Jones     Barry              220
Marsh     Peter              185
Nishi     Mami               137
Patterson Steve              152
Thompson  Leslie             114
Tseng     Foon Yue           142
Vanauf    George             211

## Level Up: Display the Number of Products each Employee Has sold

In [101]:
#Your code here
cur.execute('''select firstName, lastName,quantityOrdered
                from employees
                inner join
                    customers
                    on customers.salesRepEmployeeNumber = employees.employeeNumber
                inner join
                    orders
                    using(customerNumber)
                inner join
                    orderdetails
                    using(orderNumber);
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.quantityOrdered = pd.to_numeric(df.quantityOrdered, errors = 'coerce').fillna(0)
df.groupby(['lastName', 'firstName']).sum().sort_values('quantityOrdered')

                     quantityOrdered
lastName  firstName
Thompson  Leslie                4056
Gerard    Martin                4180
Firrelli  Julie                 4227
Nishi     Mami                  4923
Tseng     Foon Yue              5016
Patterson Steve                 5561
Bondur    Loui                  6186
Fixter    Andy                  6246
Marsh     Peter                 6632
Vanauf    George                7423
Jones     Barry                 7486
Bott      Larry                 8205
Castillo  Pamela                9290
Jennings  Leslie               11854
Hernandez Gerard               14231

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!